[
    {
        "text": "It is appalling that Cornell University appears ready to deport an international student without regard for due process, simply because of their presence at a protest. It is wrong, and I urge the university to reverse course immediately. https://t.co/JSrxOzVxKl",
        "created_at": "2024-09-27 17:39:10+00:00"
    },
    {
        "text": "Why do working class people live shorter lives than the very wealthy?\n\nStress.\n\nWhen you're worried about your landlord raising the rent ... when your medical debt is driving you toward bankruptcy ... when you're working two or three jobs ...\n\nIt takes a toll on your health. https://t.co/LJzwOl51kM",
        "created_at": "2024-09-26 22:03:42+00:00"
    },
    {
        "text": "It's going to be a good week.\n\nI hope you can join me, @GregCasar, and @AOC in Texas, and help us show the strength of the progressive movement across this country. https://t.co/nnpCqsBAkg",
        "created_at": "2024-09-26 18:30:18+00:00"
    },
    {
        "text": "Since 2018, Novo Nordisk has made nearly $50 billion in sales off of Ozempic and Wegovy. \n\n72% of that revenue coming from sales in the U.S.\n \nIn other words, the United States is Novo Nordisk’s cash cow.\n\nOur ask is simple: Stop exploiting American patients. https://t.co/GJZ6yY0jpr",
        "created_at": "2024-09-25 22:42:36+00:00"
    },
    {
        "text": "Cancel student debt. All of it. https://t.co/jL9305YObd",
        "created_at": "2024-09-24 19:07:57+00:00"
    },
    {
        "text": "Here's a big secret:\n\nProgressive economic policies are ENORMOUSLY popular among the American people.\n\n84% want to expand Medicare to cover dental, vision, and hearing.\n\n84% want to cut prescription drug costs in half.\n\n82% want the wealthy to pay their fair share in taxes. https://t.co/dpI5Y4oSkH",
        "created_at": "2024-09-23 21:31:56+00:00"
    },
    {
        "text": "Americans funded the development of all 10 drugs up for price negotiations under Medicare, shelling out a total of $11.7 billion on their research.\n\nIn 2022 alone, Big Pharma made $70 billion selling those same drugs.\n\nDoes that make sense to you? https://t.co/ArkJig5DJw",
        "created_at": "2024-09-22 20:23:05+00:00"
    },
    {
        "text": "Federal spending on weight loss drugs hit $7.9 billion last year.\n\nUnless Novo Nordisk substantially lowers the cost of Ozempic and Wegovy, the company threatens to bankrupt Medicare. https://t.co/unS9XuQe4O",
        "created_at": "2024-09-21 17:08:18+00:00"
    },
    {
        "text": "Yes, the pharmaceutical industry can afford to substantially lower the price of prescription drugs in this country. https://t.co/3y07ATNFyN",
        "created_at": "2024-09-20 21:10:49+00:00"
    },
    {
        "text": "Congratulations to the Teamster locals across the country — from Michigan to Nevada — for endorsing the Harris/Walz ticket.\n\nUnion workers know that the choice is clear:\n\nDonald Trump betrayed workers.\n\nBiden/Harris fought for workers.\n\nhttps://t.co/hvoDT6rdDO",
        "created_at": "2024-09-20 18:23:32+00:00"
    },
    {
        "text": "According to a CBS poll, 61% of Americans oppose sending weapons and supplies to Israel.\n\nThe American people understand that it is wrong to give money to a right wing, extremist government that is creating one of the worst humanitarian disasters in modern history. https://t.co/8C1KwTK5kz",
        "created_at": "2024-09-19 20:01:37+00:00"
    },
    {
        "text": "This report should come as no surprise: we have one of the worst health care systems in the world. \n\nA rational health care system should be providing universal, quality, cost-effective care. \n\nNot maximizing the profits of insurance &amp; drug companies.  \n\nhttps://t.co/h1gpZZKgqv",
        "created_at": "2024-09-19 15:03:14+00:00"
    },
    {
        "text": ".@realDonaldTrump has been in three political campaigns.\n\nHe was president for four years.\n\nWe are in the midst of a serious health care crisis — 85 million Americans are uninsured or underinsured.\n\nNow he's working on \"a concept of a plan\" ??\n\nThat's not going to cut it. https://t.co/2aK8C9NSS7",
        "created_at": "2024-09-18 23:35:42+00:00"
    },
    {
        "text": "https://t.co/gEcwASAGwW",
        "created_at": "2024-09-18 16:52:56+00:00"
    },
    {
        "text": "Much of the carnage in Gaza has been carried out with U.S.-provided military equipment.\n\nWhy on earth would the U.S. approve another $20 billion arms sale to Israel?\n\nI will move to block these weapons. Not another nickel for Netanyahu’s illegal war.",
        "created_at": "2024-09-18 16:52:55+00:00"
    },
    {
        "text": "Abolish Super PACs.\n\nOverturn Citizens United.\n\nEnd the practice of billionaires buying elections. https://t.co/RHU5oerhez",
        "created_at": "2024-09-17 23:09:49+00:00"
    },
    {
        "text": "Amazon generates $36 billion in profits a year.\n\nIt’s not radical to think their workers shouldn’t live in poverty.\n\nAmazon, stop your union busting. Obey the law. Allow workers to organize. https://t.co/eFRCYoxxYi",
        "created_at": "2024-09-17 14:16:13+00:00"
    },
    {
        "text": "It is absurd that a billionaire in America today pays the same amount of Social Security taxes as someone making $168,000 a year.\n\nIt is time to scrap the cap, expand benefits, and fully fund Social Security. https://t.co/5HBH5cYrcG",
        "created_at": "2024-09-16 19:54:17+00:00"
    },
    {
        "text": "There is no place for political violence, including the disturbing incident we just witnessed in West Palm Beach.  \n\nWe must denounce it in the strongest possible terms, and I am relieved that the former President is safe.",
        "created_at": "2024-09-15 23:03:06+00:00"
    },
    {
        "text": ".@AliVelshi's  father recently had heart surgery in Canada.\n\nThe only thing he paid for?\n\nParking. https://t.co/5HHa6IWh9u",
        "created_at": "2024-09-15 16:54:47+00:00"
    },
    {
        "text": "We must have the guts to talk about the greed of the people on top — people who want to move factories to China, shut down union drives, and pass massive tax breaks for the rich. https://t.co/Tsm5avgNBc",
        "created_at": "2024-09-12 23:20:00+00:00"
    },
    {
        "text": ".@KamalaHarris did an extremely effective job at the debate in demonstrating how absolutely unfit Trump is to become president.\n\nTo win, she must expand her agenda to include popular solutions to the most important economic realities facing this country.\n\nhttps://t.co/mFMNmRi89i",
        "created_at": "2024-09-12 17:02:12+00:00"
    },
    {
        "text": "Democracy in America means one person, one vote.\n\nIt does not mean billionaires buying elections.\n\nI would hope that everyone in this country, regardless of their political persuasion, can agree that we must overturn Citizens United. https://t.co/8n2C0wY9cb",
        "created_at": "2024-09-12 00:13:29+00:00"
    },
    {
        "text": "Last year, Coca-Cola Co. spent $327 million on advertising in the United States, while the company raked in more than $9.5 billion in profits.\n\nNot one of their ads will tell you that drinking 1 or 2 cans of Coke a day will increase your chances of getting Type 2 diabetes by 26%. https://t.co/2OAH8toeI6",
        "created_at": "2024-09-10 14:34:31+00:00"
    },
    {
        "text": "Three people on top own more wealth than the bottom half of American society.\n\nBillionaires pay an effective tax rate lower than truck drivers.\n\nElderly people cannot afford dental care.\n\nYes. It's time to take on the big monied interests that have so much power in our country. https://t.co/zc0y8ggvES",
        "created_at": "2024-09-09 19:04:12+00:00"
    },
    {
        "text": ".@ATT is a multi-BILLION dollar company.\n\nThey can absolutely afford to treat their workers with the dignity they deserve.\n\nAT&amp;T must come to the table and negotiate a fair contract. https://t.co/oesx12QEKZ",
        "created_at": "2024-09-06 23:14:32+00:00"
    },
    {
        "text": "Three words we can't use to describe prescription drugs in the US: nice, easy, affordable.\n\nWe have made some progress under President Biden — seniors now pay no more than $2k/year for their prescriptions.\n\nBut it's not enough. We must cap prescription costs for ALL Americans. https://t.co/CyzzugRF7S",
        "created_at": "2024-09-05 23:23:10+00:00"
    },
    {
        "text": "Conservatives and progressives disagree on plenty, but many of us have something in common:\n\nWe do not want to see American democracy undermined by Donald Trump's cult of personality. https://t.co/CETZRkiwl3",
        "created_at": "2024-09-05 00:14:52+00:00"
    },
    {
        "text": "Rather than obey the law and negotiate a new contract for its 17,000 workers, @ATT decided to illegally drag its feet and refuse to bargain in good faith. \n\nThe company should stop playing these games with workers’ lives and reach a fair deal. https://t.co/GCwhroRjxX",
        "created_at": "2024-09-04 22:23:25+00:00"
    },
    {
        "text": "Despair is not an option.\n\nIf you want to live in a sane and decent society, if you want a better world for your kids, you must stand up and fight for a better America. https://t.co/vNA5LBQqAe",
        "created_at": "2024-09-03 23:22:11+00:00"
    },
    {
        "text": "Yes, Governor Walz has a defined benefit pension plan. That's good. He earned it.\n\nAt a time when about half of older workers have no retirement savings, we've got to restore defined benefit pensions so that all Americans can retire with the respect and the dignity they deserve. https://t.co/fuzKeFoS6l",
        "created_at": "2024-09-03 16:05:41+00:00"
    },
    {
        "text": "As we celebrate Labor Day, let us continue the fight for a worker’s agenda that includes passing the PRO Act to end union busting; raising the federal minimum wage to a living wage; Paid Family and Medical Leave; and a pro-worker trade policy. Happy Labor Day. https://t.co/VpkxuDCEfK",
        "created_at": "2024-09-02 19:26:34+00:00"
    },
    {
        "text": "As we approach Labor Day, let us not forget that the United States is the ONLY major nation not to guarantee workers paid family and medical leave.  \n\nThere are moms in this country who give birth, and are forced back to work a week later.  \n\nAbsolutely unacceptable.",
        "created_at": "2024-09-01 19:24:11+00:00"
    },
    {
        "text": "Every scientist in the world understands that climate change is real, and caused by human activity.\n\nIf we don’t get a handle on it, it will only get worse.\n\nDonald Trump believes that climate change “is a hoax created in China.”\n\nThat is insane. https://t.co/5cRhYYMPNN",
        "created_at": "2024-09-01 18:46:26+00:00"
    },
    {
        "text": "82% of Americans believe that the wealthy and corporations should pay their fair share in taxes.\n\nA small number of Wall Street executives and Silicon Valley investors disagree.\n\nWe cannot allow a handful of billionaire donors to decide our tax code. https://t.co/f6w2TCEewn",
        "created_at": "2024-08-31 22:08:42+00:00"
    },
    {
        "text": "The Republican Party wants more tax breaks for billionaires, and massive cuts to Social Security and benefits.\n\nIt wants to allow polluters to destroy our planet and drug companies to charge us whatever they want.\n\nTHAT is radical. \n\nhttps://t.co/pydo9H5rV4",
        "created_at": "2024-08-30 16:35:37+00:00"
    },
    {
        "text": "If the American people strongly support a progressive economic agenda, why hasn't it been implemented?\n\nThe answer is simple: Money.\n\nWe need to move to the public funding of elections, and end the practice of billionaires controlling our political process. https://t.co/55HSRmIa4p",
        "created_at": "2024-08-29 16:54:44+00:00"
    },
    {
        "text": "70% of Americans support unions.\n\nWhy?\n\nUnion workers:\n\n- Earn nearly 20% more than non-union workers on average.\n- Are more likely to have good benefits like health care and pensions.\n- Have greater protections against dangerous workplaces. https://t.co/hOGmDcjggh",
        "created_at": "2024-08-28 21:39:47+00:00"
    },
    {
        "text": "We need to get Big Money out of our political process.\n\nBillionaires in both parties should not be able to buy elections.\n\nFor the sake of our democracy we must overturn the disastrous Citizens United Supreme Court decision and move toward public funding of elections. https://t.co/LO31UNNx7m",
        "created_at": "2024-08-28 17:32:37+00:00"
    },
    {
        "text": "The American people want stability in the White House.\n\nThey want somebody they can trust.\n\nAnd more and more people are understanding that is not who Donald Trump is. https://t.co/nYKeaRjrug",
        "created_at": "2024-08-27 20:14:49+00:00"
    },
    {
        "text": "Here's the truth about America today:\n\nIf you're rich, you'll live a long life.\n\nIf you're working class, you'll die 10 years sooner.\n\n@TheoVon and I agree — it's time to do something about that discrepancy. https://t.co/LPtY514Ksa",
        "created_at": "2024-08-26 20:44:28+00:00"
    },
    {
        "text": "Having private health insurance doesn’t mean a damn thing if you have a $7,000 deductible that you can’t afford. https://t.co/KVZRiFrINn",
        "created_at": "2024-08-25 18:24:51+00:00"
    },
    {
        "text": "Olympic athletes competing in Paris were stunned to discover that, in France, free health care is a human right.\n\nMeanwhile, in the U.S., 1 in 4 cancer patients go bankrupt or lose their homes because their treatment is so expensive.\n\nWe need Medicare for All. https://t.co/abu1AqED8b",
        "created_at": "2024-08-23 21:37:01+00:00"
    },
    {
        "text": ".@KamalaHarris understands that good policy is good politics.\n\nShe is prepared to lower the cost of prescription drugs, end medical debt, and finally address the housing crisis that has touched every corner of this country. https://t.co/3Rk1C8hcte",
        "created_at": "2024-08-22 21:24:53+00:00"
    },
    {
        "text": "We need @StevenHorsford's voice in Congress.\n\nHe is a powerful champion for workers and has been leading the fight in Nevada to make housing safer and more affordable.\n\nI urge Nevadans to join me in supporting his campaign. https://t.co/aJ8GpppFmE",
        "created_at": "2024-08-21 17:08:08+00:00"
    },
    {
        "text": "In the last three-and-a-half years, working together, we have accomplished more than any government since FDR.\n\nBut much more remains to be done.\n\nWe must have the courage to stand up to wealth and power and deliver justice for people at home and abroad. https://t.co/mSSYWz4vI9",
        "created_at": "2024-08-21 14:23:33+00:00"
    },
    {
        "text": "Join me as I address the need to confront corporate greed at the DNC in Chicago. https://t.co/DrWqszx5eD",
        "created_at": "2024-08-21 01:27:28+00:00"
    },
    {
        "text": "Tonight, I will address the Democratic National Convention.\n\nJoin me at 9:20pm EST.\n\nhttps://t.co/cDvH9x6yXE https://t.co/EgB3Yyv7vE",
        "created_at": "2024-08-20 16:26:09+00:00"
    },
    {
        "text": "The U.S. Senate must prioritize issues that the vast majority of Americans care about. \n\nI have a couple of ideas:\n\n1) Expand Medicare to include vision, dental, and hearing\n\n2) Expand Social Security\n\nIf Republicans want to vote no, I wish them luck in their next election. https://t.co/i5BqTUfUaL",
        "created_at": "2024-08-19 00:54:09+00:00"
    },
    {
        "text": "The American people have been clear: they want a higher minimum wage, expanded Social Security, and better health care.\n\nDonald Trump just wants to give billionaires another tax break.\n\nThis November, the choice is clear. https://t.co/YmUpnA0PvD",
        "created_at": "2024-08-18 17:08:21+00:00"
    }
]