[
    {
        "comment": "@Jaren_Briggs @stevenmarkryan D4 is harder than it seems to achieve super fast pit clear times. \n\nI look forward to trying PoE2.",
        "original_tweet": "@stevenmarkryan I hope he moves to Path of Exile 2. D4 is too simple now. Game is an illusion of choice with everyone playing the same builds. Zzzzz. That being said, it's awesome he plays games and can relax with his boy while saving the free world and still making top 30!! Good stuff there!… https://t.co/qwGcvGa6dH",
        "created_at": "2024-10-23 07:51:56+00:00"
    },
    {
        "comment": "@stevenmarkryan I notice you’re ahead of me 😂",
        "original_tweet": "Bro is out here casually posting top global top 30 pit ladder times 😂 https://t.co/LH3bOdJhoD https://t.co/KgquvR60RC",
        "created_at": "2024-10-23 07:50:36+00:00"
    },
    {
        "comment": "@HSajwanization Everyone will forget about him after the election",
        "original_tweet": "Are you guys voting for this clown ??  Are you serious ?? \n\n🤡 https://t.co/esSUGqkUJ7",
        "created_at": "2024-10-23 07:30:30+00:00"
    },
    {
        "comment": "@BrianRoemmele Reminds me of playing Fallout",
        "original_tweet": "Palm Springs, 1961. https://t.co/0BA6AJfOid",
        "created_at": "2024-10-23 06:11:54+00:00"
    },
    {
        "comment": "@shaunmmaguire I’m hearing one crazy story after another",
        "original_tweet": "Fuck it\n\nA Congressman told me two weeks ago that California has 23M registered voters but has mailed out 30M ballots\n\nI asked his team to confirm and they haven't responded\n\nCan anyone confirm or deny this?\n\nIf this is the case, it's unacceptable\n\nIn person voting with ID.",
        "created_at": "2024-10-23 05:15:00+00:00"
    },
    {
        "comment": "@MikeBenzCyber Which law firms are behind this?",
        "original_tweet": "All of these are litigated out-of-state, in front of home court judges &amp; juries for activist politicos propping up astroturfed plaintiffs. \n\nStates need to fight back w/ domestic legislation to limit foreign states from limitlessly financially assassinating their home residents.",
        "created_at": "2024-10-23 04:02:46+00:00"
    },
    {
        "comment": "@Rothmus Over 20 million people will watch that conversation",
        "original_tweet": "Complete leftist meltdown 🤣🤣 https://t.co/JRryoBulPm",
        "created_at": "2024-10-23 02:17:31+00:00"
    },
    {
        "comment": "@AutismCapital DJT has the constitution of an ox. Very impressive.",
        "original_tweet": "🚨TRUMP: \"Do you know where Kamala is today? She's sleeping. She took a day off. She's got no energy at all, her speeches last for about 15 minutes, and she's out of there.\n\nThink of this, we have 14 days until the most important election of our country. For us, it's important,… https://t.co/rxqyI82kxS https://t.co/C4TR5Zcwcl",
        "created_at": "2024-10-22 23:48:10+00:00"
    },
    {
        "comment": "@tunguz You mean in terms of what AI can do?",
        "original_tweet": "You guys have no idea what’s coming.\n\nNo idea.",
        "created_at": "2024-10-22 23:41:17+00:00"
    },
    {
        "comment": "@AutismCapital They know they’re gonna lose",
        "original_tweet": "🚨WALZ: \"I want to talk abut Trump's running mate. ELON MUSK. Elon Musk is on stage jumping around, skipping like a DIPSHIT. That guy is literally the richest man in the world, spending millions of dollars to help Donald Trump buy an election.\n\nDonald Trump has promised Elon… https://t.co/Dh9dnrgkJO https://t.co/2Q0tvkhjLz",
        "created_at": "2024-10-22 20:33:07+00:00"
    },
    {
        "comment": "The margin of the Biden PA win in 2020 was ~80k votes. Just based on the early vote delta, Pennsylvania will go Republican in 2024, but we cannot be complacent. \n\nDrag your friends &amp; family to vote now!",
        "original_tweet": "Two weeks ago, the early vote delta in Pennsylvania for 2024 was worse for Republicans than 2020. It is now dramatically better.\n\nKeep voting!! https://t.co/451c8cLrzo",
        "created_at": "2024-10-22 20:25:11+00:00"
    },
    {
        "comment": "@AutismCapital Nobody cares about puppets of the machine",
        "original_tweet": "🚨 WALZ: \"The consequences of putting Trump back in office are deadly serious. He's talking about sending the military against people who don't support him. He's naming names. I recognize I'm going to be at the top of that list. You think he'll stop with me? He's talking about… https://t.co/4bQlWqP4Vg https://t.co/5FRI1zVmva",
        "created_at": "2024-10-22 20:20:52+00:00"
    },
    {
        "comment": "@WesternLensman You’re gonna lose, @Tim_Walz 🤡 \n\nSaving the American people from the torture of hearing you speak for 4 years was worth it 😂",
        "original_tweet": "JUST IN: Tim Walz attacks @elonmusk as Trump’s “running mate” — says Elon was “up on that stage, jumping around, skipping like a dipsh*t.\"\n\nHoly Moly. The irony here from this guy is off the freakin charts.\n\n\"So look, Elon's on that stage, jumping around, skipping like a… https://t.co/w97EkTgkqD https://t.co/57Ih4LrWsj",
        "created_at": "2024-10-22 20:17:56+00:00"
    },
    {
        "comment": "@DanicaPatrick Nothing would sink Kamala’s campaign faster than a 3 hour unscripted conversation with Joe Rogan 😂",
        "original_tweet": "Let’s goooooooo! What are the chances Kamala will do it?! 😜 https://t.co/i7IORei79b",
        "created_at": "2024-10-22 19:29:59+00:00"
    },
    {
        "comment": "@FutureJurvetson These were done in spite of, not because of, the California government. It would be far lower cost to manufacture in other states, which is why our competitors moved out of state.\n\nThat was because I lived in California.",
        "original_tweet": "@FutureJurvetson Boeing and Lockheed moved their rocket production from California to Alabama. \n\nSpaceX took over an abandoned aerospace building in LA County and turned it into the highest volume rocket producer in the world. \n\nThat was because I lived in California.",
        "created_at": "2024-10-22 19:27:48+00:00"
    },
    {
        "comment": "@FutureJurvetson Boeing and Lockheed moved their rocket production from California to Alabama. \n\nSpaceX took over an abandoned aerospace building in LA County and turned it into the highest volume rocket producer in the world. \n\nThat was because I lived in California.",
        "original_tweet": "@FutureJurvetson The last automotive factory in California (NUMMI) shut down in early 2009. \n\nTesla took over the derelict building, after it was stripped of anything useful, and it is now the highest production car factory in the Americas!\n\nThat was simply because I lived in California.",
        "created_at": "2024-10-22 19:26:00+00:00"
    },
    {
        "comment": "@FutureJurvetson The last automotive factory in California (NUMMI) shut down in early 2009. \n\nTesla took over the derelict building, after it was stripped of anything useful, and it is now the highest production car factory in the Americas!\n\nThat was simply because I lived in California.",
        "original_tweet": "I suspect Elon's companies created most CA jobs for the decade before the gov't gleefully ran him out of town.  Now TX is booming instead.\n\nCalifornication is tragic:\n\"The latest statistics show that nearly all jobs that are being created in California are government jobs.… https://t.co/9T9gGDAcGU https://t.co/WiW4hwC1iA https://t.co/5uitqCQFXo",
        "created_at": "2024-10-22 19:24:12+00:00"
    },
    {
        "comment": "@AutismCapital Yet another Diddy party participant",
        "original_tweet": "🚨 No surprises there! https://t.co/zh2bR78Kfa https://t.co/EmWmdHsLCc",
        "created_at": "2024-10-22 17:07:08+00:00"
    },
    {
        "comment": "@dhaval_shroff That would work like a charm",
        "original_tweet": "Road contractors and car insurance providers should be compensating all the commuters who got delayed because of the peak hour roadwork or accident respectively. At least there will be some incentive to sort things out quickly.",
        "created_at": "2024-10-22 16:45:11+00:00"
    },
    {
        "comment": "@ajtourville @Tesla That movie sucked",
        "original_tweet": "NEWS: Blade Runner 2049 Alcon Entertainment is suing @Tesla and Warner Bros over claims they used images tied to the film to promote Tesla Cybercab.\n\nThe absurd lawsuit accuses Tesla of “false endorsement” for suggesting a relationship between Alcon and the EV maker. https://t.co/1ceyoFqY9M",
        "created_at": "2024-10-22 16:43:30+00:00"
    },
    {
        "comment": "@PeterSweden7 The hypocrisy of the dictatorial left claiming to defend democracy while in fact opposing it!",
        "original_tweet": "BREAKING: The Austrian president has broken with custom and has not appointed the right-wing Freedom Party to form a government despite winning the election.\n\nSo the right-wing won the election but won't be allowed to try and form a government.",
        "created_at": "2024-10-22 16:39:08+00:00"
    },
    {
        "comment": "@BillboardChris Olson-Kennedy is evil",
        "original_tweet": "Johanna Olson-Kennedy previously received a $5.7 million grant from the NIH for research into transitioning children.\n\nThis ‘research’ included giving cross-sex hormones to 8-year-olds! https://t.co/CewdIjkDsq",
        "created_at": "2024-10-22 08:23:11+00:00"
    },
    {
        "comment": "@charliekirk11 We should not have state-funded media",
        "original_tweet": "The media now say that asking Kamala to prove she actually worked at McDonalds, instead of just mindlessly believing her, is \"insidious\" and \"outside the lines of traditional fair play in politics.\"\n\nYou know what’s not fair play? Trying to throw your political opponent in… https://t.co/m67wK57ykZ https://t.co/qmZ8nbHYvp",
        "created_at": "2024-10-22 07:50:03+00:00"
    },
    {
        "comment": "@micsolana Fries cooked in beef tallow are better",
        "original_tweet": "i've been waiting for the mcdonald's discourse pivot to beef tallow french fries. thank you, bob, and fuck canola oil. let's make fast food great again! https://t.co/7Bnwv2msVH",
        "created_at": "2024-10-22 07:49:08+00:00"
    }
]