[
    {
        "comment": "@9Discordia9 @NABurkinshaw @Freerangescots Don't tempt me. I've been on a break but now it's back to Strike.",
        "original_tweet": "@jk_rowling @NABurkinshaw @Freerangescots I so want you to write us all a horoscope\nIt would be the first one I would believe",
        "created_at": "2024-10-22 18:31:52+00:00"
    },
    {
        "comment": "@LadyNorvician @NABurkinshaw @Freerangescots You people are literally the worst. Except for the Ass-wholes, obviously.",
        "original_tweet": "@jk_rowling @NABurkinshaw @Freerangescots Oh my word, I'm lidderly a Cuspoid CUNT! https://t.co/Vvobpa0HRz",
        "created_at": "2024-10-22 18:28:20+00:00"
    },
    {
        "comment": "@BettsCaro @NABurkinshaw @Freerangescots Please don't mock your mother's identity. I'd hate to think any Celestial Unbelieving Non-Tolerants were following me.",
        "original_tweet": "@jk_rowling @NABurkinshaw @Freerangescots Oh don’t!!!!!!\nMy Momma was on the cusp of Cancer (water) and Leo (fire) and always insisted that this was the reason she had lots of stuff but couldn’t tidy up 😂",
        "created_at": "2024-10-22 18:26:23+00:00"
    },
    {
        "comment": "@PhilJon07784075 @Serena_Partrick You have excellent taste. Listening to Swordfish Trombones right now.",
        "original_tweet": "@Serena_Partrick @jk_rowling Swordfish Trombones, Rain Dogs and Frank's Wild Years changed my life forever, the first especially I listened to obsessively",
        "created_at": "2024-10-22 17:08:55+00:00"
    },
    {
        "comment": "@MadManDrivel Absolutely not, I love him.",
        "original_tweet": "@jk_rowling An act of purist masochism if ever there was one. 🙉",
        "created_at": "2024-10-22 16:39:11+00:00"
    },
    {
        "comment": "@Jingerella66 @adammcarter You're not a modern day 'civil rights' movement until someone starts nitpicking language. I dream of the day when the placement of a hyphen leads to actual bloodshed. Let the in-fighting commence!",
        "original_tweet": "@jk_rowling @adammcarter I'm awfully sorry to be pedantic, but I'm Cancerian so it behoves me to correct you. Shouldn't that be 'ass-signed'",
        "created_at": "2024-10-22 16:07:02+00:00"
    },
    {
        "comment": "@michaelpforan Can't believe you called India a D list news presenter. Not when the alphabet goes all the way to Z.",
        "original_tweet": "I’m a Dr because I have a PhD in law from the University of Cambridge, where I completed a thesis on Equality Before the Law, the Rule of Law and unlawful discrimination. It won the Yorke prize. I probably know more about discrimination law than a D list news presenter. https://t.co/AYdNdWMbWK",
        "created_at": "2024-10-22 12:24:53+00:00"
    },
    {
        "comment": "@damekatydenise_ You never heard my ‘Non-Menstruating Parent Cool’. It brought grown AMABs to tears.",
        "original_tweet": "@jk_rowling Didn’t refute point 2 I see. Your version of ‘Brown Birthing Body In The Ring’ needs work.",
        "created_at": "2024-10-22 11:37:32+00:00"
    },
    {
        "comment": "@vikki_sewell @adammcarter We welcome ass-allies as long as you realise your main job is to amplify Nont voices. To be honest, this tweet seems to be all about you, whereas everything, always, should be about us.",
        "original_tweet": "@jk_rowling @adammcarter Finally it all makes, I'm definitely an ass-woman Aries. I enjoy setting fire to things, being right, hate lies and I'm happiest wrapped up in fluffy wooly things. Lookingvforward to diving further into this incredible new science",
        "created_at": "2024-10-22 11:26:08+00:00"
    },
    {
        "comment": "@AlessandraAster @adammcarter Sounds to me like you’re a Nont Capricorn. Can’t dance to save their lives. If you also enjoy mountain climbing and the trappings of wealth and success, it’s conclusive. Welcome to the Nont community.",
        "original_tweet": "@jk_rowling @adammcarter I am an ass Libra but I cannot dance to save my life. Maybe I am a Nont too.",
        "created_at": "2024-10-22 11:22:59+00:00"
    },
    {
        "comment": "@eva_kurilova Congratulations Eva and welcome to the world Gracie! ❤️🎉",
        "original_tweet": "After labor stalled and even reversed at 9 cm and the baby's heart rate was very concerning, I finally had a c-section. These past two days were the hardest and most worthwhile of my life. It doesn't matter how she ended up getting here but Gracie is here now and she's perfect ♥️ https://t.co/awhYAbOi82",
        "created_at": "2024-10-22 08:55:50+00:00"
    },
    {
        "comment": "@DelanceyUK @AlastairGrahame @adammcarter I shall be starting a Nont support/activist group shortly. Get your balaclava, tins of soup and baseball bat ready.",
        "original_tweet": "@jk_rowling @AlastairGrahame @adammcarter I'm nont.  I have tried really hard to be the Capricorn I was assigned at birth but although I've got the hang of a lot of it my diet lacks hair ribbons, I can't grow a goatee, and my eyes are just wrong. I don't identify with any of the other signs so I guess I'm extra special.",
        "created_at": "2024-10-22 08:39:47+00:00"
    },
    {
        "comment": "@9Discordia9 @adammcarter Allow me a Judith Butleresque smirk at your failure to grasp the complexity of astro-identity. Schmidt's work has been thoroughly debunked. There are WAY more than 14 astro-identities.",
        "original_tweet": "@jk_rowling @adammcarter You forgot shmidt 14-signs typology, you bigot",
        "created_at": "2024-10-22 08:22:33+00:00"
    },
    {
        "comment": "@adammcarter #NontRightsAreHumanRights",
        "original_tweet": "I’m still thinking about this tweet 😂👏🏻 https://t.co/27ecZljOJo",
        "created_at": "2024-10-21 22:14:48+00:00"
    },
    {
        "comment": "@damekatydenise_ He wasn't blind, he had a lazy eye, and it was Clacton.\nSo much for 'facts.'",
        "original_tweet": "I turned down two offers of a peerage in the House of Lords, out of pity I said to offer them to @jk_rowling. Let’s put the record straight, she never turned them down! \n\nThe 1st time she didn’t answer her phone as she was on an all dayer with a blind taxidermist in Cleethorpes.… https://t.co/8oZN67MQ44",
        "created_at": "2024-10-21 22:02:02+00:00"
    },
    {
        "comment": "@terpsitone I'm afraid there's no Enneagram type 11. You've missed a key part of the assignment.",
        "original_tweet": "@jk_rowling Boron doesn't exist by itself in nature.  Me: Roentgenium.",
        "created_at": "2024-10-21 13:59:53+00:00"
    },
    {
        "comment": "@kafolkert It's a cooler name, I agree. I think I like Boron because there's less to live up to.",
        "original_tweet": "@jk_rowling Nothing really, it’s completely and utterly inert and reacts with nothing. Hmm…I guess that’s a little interesting. It’s exceptional at being dull. Also it mostly just sounds cool as a name. I’d rename myself “Argon”. I totally would.",
        "created_at": "2024-10-21 13:57:34+00:00"
    },
    {
        "comment": "@kafolkert Also, what's so good about Argon?",
        "original_tweet": "@kafolkert But Boron doesn't just have 5 letters, it also has the atomic number 5.",
        "created_at": "2024-10-21 13:47:58+00:00"
    },
    {
        "comment": "@kafolkert But Boron doesn't just have 5 letters, it also has the atomic number 5.",
        "original_tweet": "@jk_rowling MAJOR missed opportunity not to use Argon.",
        "created_at": "2024-10-21 13:47:41+00:00"
    },
    {
        "comment": "@AusCroc You're right. I'm slightly surprised there isn't one.",
        "original_tweet": "@jk_rowling If we were to tell someone outside of the UK that Bor-on-Thyme was a real town in the UK they would 100% believe it",
        "created_at": "2024-10-21 13:45:21+00:00"
    },
    {
        "comment": "@Mug_of_Gasoline @KatiePiper_ Please share the reams of proof you undoubtedly have that I want trans people to jump out of windows/send trans people messages telling them to kill themselves. Otherwise we might have to conclude you're completely delusional.",
        "original_tweet": "@jk_rowling @KatiePiper_ You'd say the same thing to a trans person, stop acting like you're any better",
        "created_at": "2024-10-20 16:47:16+00:00"
    },
    {
        "comment": "@Drusilla451 Of course, because the things that actually make us female are the things they can never have, so these core sex characteristics must be downgraded and denigrated in favour of things men can have too.",
        "original_tweet": "@jk_rowling These men say they are so desperate to experience having a female body but are so quick to denigrate, downplay and belittle all the amazing things our actual female bodies are capable of doing",
        "created_at": "2024-10-20 15:33:01+00:00"
    },
    {
        "comment": "@KatiePiper_ I'm so, so sorry. This is utterly vile. You're a beautiful, inspirational, much-loved woman, and that probably grates on lonely sociopaths who struggle to conceal the fact that they're slowly rotting from the inside out.",
        "original_tweet": "After completing my run this morning, feeling already depleted because of my bad time, I opened my phone to this. I can handle most things, but sometimes it adds to an already heavy load you are carrying. https://t.co/AcAXKfY06F",
        "created_at": "2024-10-20 15:05:37+00:00"
    },
    {
        "comment": "@Fifi_Borgia You aren't a dame if you accept a peerage, you're Baroness or Lady X. If you're still confused, @damekatydenise_ can explain it all to you.",
        "original_tweet": "@jk_rowling Because Dame sounds old?",
        "created_at": "2024-10-20 13:44:49+00:00"
    },
    {
        "comment": "@garylfrancione Doesn't matter in the slightest. My clarification might yet save me from such classic hot takes such as 'Badenoch wants to give her a peerage ergo JKR's right wing' and 'JKR really wants a peerage and is disappointed she hasn't got one because of her evil bigotry'.",
        "original_tweet": "@jk_rowling Sorry. It was meant completely tongue in cheek. Her answer also went on to talk about the \"oddballs\" (🤣) who harass you and Dr. Cass. Anyway, it wasn't a serious question. Sorry. I deleted.",
        "created_at": "2024-10-20 10:47:27+00:00"
    },
    {
        "comment": "@SmoothSnailAnts I don’t need the animal rights people after me too…",
        "original_tweet": "@jk_rowling You’d look great in ermine, though.",
        "created_at": "2024-10-20 07:18:49+00:00"
    },
    {
        "comment": "@DJBrabrook @Justalurke35517 Wrong. The Ladyboys did one gig with Waxed Sack, then split up.",
        "original_tweet": "@jk_rowling @Justalurke35517 No I'm pretty sure it was hairy scrotum and the ladyboys supporting",
        "created_at": "2024-10-19 22:44:41+00:00"
    },
    {
        "comment": "@Justalurke35517 They'd disbanded by then. You're thinking of Lady Dick and the Hanging Ovaries.",
        "original_tweet": "@jk_rowling I saw Hairy Cleavage open for the Stones at the Coliseum in '78.",
        "created_at": "2024-10-19 22:36:45+00:00"
    },
    {
        "comment": "@Kathleen101001 If forcing women who don't want to touch your penis to do so isn't a key indicator of being one of the most oppressed people on earth, I really don't know what is.",
        "original_tweet": "@jk_rowling Strip searches may involve examination of the genitals and anus. So men can now force women to look at their exposed penises and then straight after bend over and force them to look at their arseholes. But this isn't a predatory men's rights movement.",
        "created_at": "2024-10-19 08:01:29+00:00"
    },
    {
        "comment": "@PeteBritish Ink Black Heart recorded and on screens (relatively) soon.",
        "original_tweet": "@jk_rowling We're so ready for Tom and Holliday to come back, Jo.\nAre there any series in the pipeline, do you know?",
        "created_at": "2024-10-18 21:02:30+00:00"
    },
    {
        "comment": "@DreyfusJames @damekatydenise_ Thank you for that prompt. I shall be sending each and every rider a cushioned armchair forthwith.",
        "original_tweet": "@jk_rowling Are the riders actually sitting down?? This is rage bait to @damekatydenise_ \nShe’ll be f**king fewwminn’.",
        "created_at": "2024-10-18 21:01:16+00:00"
    },
    {
        "comment": "@michaelpforan @bindelj What are you implying?",
        "original_tweet": "@bindelj @jk_rowling Just goes to show how manly and masculine I am ☺️☺️☺️",
        "created_at": "2024-10-18 19:46:26+00:00"
    },
    {
        "comment": "@bindelj @adammcarter @RoddyQC I can't believe this. I told you in confidence that the dream of my life was to be an influencer sharing details of my perfect marriage, flan recipes and vaccine conspiracies. #betrayal #trustbroken",
        "original_tweet": "@jk_rowling @adammcarter @RoddyQC Let it go, Jo. At this stage you are simply humiliating yourself. A failed influencer, and now a failed wife. DEAL WITH IT!",
        "created_at": "2024-10-18 19:09:37+00:00"
    },
    {
        "comment": "@adammcarter @bindelj @RoddyQC Good point. I've never karyotyped Neil's, either. Now I realise that just because he got me pregnant, and I gave birth to the kids, he could be a woman and I could be a man, and Bindel could be either. What hurts is that I appear to be the third wheel, whatever sex we all are.",
        "original_tweet": "@jk_rowling @bindelj @RoddyQC Umm have you even karyotyped her chromosomes?!",
        "created_at": "2024-10-18 18:56:16+00:00"
    },
    {
        "comment": "@bindelj @RoddyQC Bindel, we both know that when it comes to two women fighting over the same man, sisterhood evaporates like ice cubes on a griddle. And what the hell do you mean, REAL WOMAN? You haven't even got a penis.",
        "original_tweet": "@jk_rowling @RoddyQC No need for this feminine rivalry. If you had an ounce of feminism you would relish the thought of your man finding his true self with a REAL WOMAN",
        "created_at": "2024-10-18 18:42:34+00:00"
    },
    {
        "comment": "@michaelpforan @bindelj @RoddyQC Can't believe you fell for that. Oldest trick in the book.",
        "original_tweet": "@bindelj @jk_rowling @RoddyQC You told me you were a lesbian! 😭",
        "created_at": "2024-10-18 18:39:21+00:00"
    },
    {
        "comment": "@bindelj @RoddyQC I first got suspicious when I caught him reading your book. A man, reading a book written by a woman? Now he's drinking your favourite drink. I swear, if I find out he's been buying beetroot, you'll need to find yourself a good second. And I call dibs on Kath before you can.",
        "original_tweet": "@jk_rowling @RoddyQC I deny EVERYTHING",
        "created_at": "2024-10-18 18:36:02+00:00"
    },
    {
        "comment": "@MattDoogue @bindelj Bourbon. This one’s Maker’s Mark.",
        "original_tweet": "@jk_rowling @bindelj Whisky of choice for you Old Fashioned?",
        "created_at": "2024-10-18 17:17:55+00:00"
    },
    {
        "comment": "@LolaH1323 @bindelj I’ve had one Gin Fizz in my life, and I liked it.",
        "original_tweet": "@jk_rowling @bindelj Yum my dad makes the most amazing Old Fashioneds and Gin fizzes which I think are underrated.",
        "created_at": "2024-10-18 17:16:48+00:00"
    },
    {
        "comment": "@RoddyQC @bindelj That’s EXACTLY what the person having an affair with my husband WOULD say.",
        "original_tweet": "@jk_rowling @bindelj Well, it’s not me - I promise.",
        "created_at": "2024-10-18 17:14:28+00:00"
    },
    {
        "comment": "@Martina Happy birthday you absolute goddess 🥂🎉",
        "original_tweet": "My feed is blowing up with Happy Birthday messages-I appreciate them all and I appreciate you all too, thank you!!!\n😊🙏🏼👊🏼😘",
        "created_at": "2024-10-18 16:03:54+00:00"
    },
    {
        "comment": "Neil's just joined me with the information that he chose option 4.",
        "original_tweet": "Done loads of work on #TheHallmarkedMan this week. What Friday night cocktail would be most appropriate to unwind? 🧬🦢🩶🅰️",
        "created_at": "2024-10-18 16:01:56+00:00"
    },
    {
        "comment": "@Otni_el_ Take one dash of bitters, another dash of bitters, mix well and add bitters to taste. Garnish with a pickled onion.",
        "original_tweet": "@jk_rowling I've never had a Poll Is Transphobic, what's it similar to?",
        "created_at": "2024-10-18 16:01:32+00:00"
    },
    {
        "comment": "@HamiltonNashHR I usually have bourbon Old Fashioneds, but you haven't lived until you've drunk the rum version at Chutney Mary in London.",
        "original_tweet": "@jk_rowling I have a particular penchant for an Old Fashioned made with a fine rum.",
        "created_at": "2024-10-18 15:59:44+00:00"
    },
    {
        "comment": "@Gillian_Philip Quite like a Manhattan, but it's never made my top three.",
        "original_tweet": "@jk_rowling This is excellent news, I see a Manhattan is not yet transphobic. Please try to avoid naming those.",
        "created_at": "2024-10-18 15:57:44+00:00"
    },
    {
        "comment": "@TerezaKovacsova @msjlindsay Wow, I love them!!!",
        "original_tweet": "@jk_rowling @msjlindsay I love your books, @jk_rowling ! I crocheted Harty and Paperwhite 🖤 https://t.co/uDW9BHexKT",
        "created_at": "2024-10-18 09:15:55+00:00"
    },
    {
        "comment": "@ColonMontgomery @msjlindsay Kimono flapping all the way...",
        "original_tweet": "@jk_rowling @msjlindsay I can hear the squeak of metal across a freshly polished marble floor.\n\n“Put the bat down, Jolyon!”",
        "created_at": "2024-10-18 08:41:03+00:00"
    },
    {
        "comment": "@emmablack77 @RedWallPleb Roz is working again, happily. She’s now employed by Beira’s Place, a female-only rape crisis centre in Edinburgh.",
        "original_tweet": "@RedWallPleb @jk_rowling No I would have to say not but the calculation will have been done with the thought process that others will now come forward. Is the charity as employer who will pay but this causes further issues for the victim. Who probably won’t work again.",
        "created_at": "2024-10-16 07:20:35+00:00"
    },
    {
        "comment": "(Deleted then reposted two of the thread because I got Sharon Cowan's name wrong)",
        "original_tweet": "How much more physical, emotional and mental harm will have to be done to women and girls, especially the most vulnerable, before gender ideologues like Sandy Brindley admit all they've achieved is furthering men's rights at the expense of those they can't define? 12/X",
        "created_at": "2024-10-15 15:33:05+00:00"
    },
    {
        "comment": "How much more physical, emotional and mental harm will have to be done to women and girls, especially the most vulnerable, before gender ideologues like Sandy Brindley admit all they've achieved is furthering men's rights at the expense of those they can't define? 12/X",
        "original_tweet": "During sentencing, the judge highlighted Downing’s 'hostility towards women, lack of concern for others, sexual preoccupation and deviant sexual preference'.\n\nWhen, if ever, are those committed to gender ideology going to admit they got it wrong? 11/12\nhttps://t.co/jWgvKQRLYz",
        "created_at": "2024-10-15 15:32:08+00:00"
    },
    {
        "comment": "Most shockingly of all, this year we learned that Cameron Downing, a now-jailed male sexual predator who’d previously tweeted that he wanted to ‘beat the fuck’ out of feminists, was allowed to access ‘support’ at the Edinburgh centre because he identifies as ‘non-binary.’ 10/12",
        "original_tweet": "Their concerns were dismissed. Some survivors said they felt re-traumatised by the response they met from Brindley, and from her trans activist partner Sharon Cowan, who attended the meeting in spite of having no professional role at RCS at all. 9/12\nhttps://t.co/UVtJUmGp3r",
        "created_at": "2024-10-15 15:29:18+00:00"
    },
    {
        "comment": "One direct consequence of Brindley's ideological stance is that rape survivors have self-excluded from the Edinburgh centre, because of the toxic culture flourishing there.\n\nIn 2022, a group of survivors tried to raise their concerns with Brindley at a meeting. 8/12",
        "original_tweet": "We've already seen ample evidence of what happens when this ideology is imposed on institutions: sportswomen placed in serious physical danger, female prisoners incarcerated with rapists, girls' honours taken by boys, predatory men taking full advantage of new conditions. 7/12",
        "created_at": "2024-10-15 15:25:45+00:00"
    },
    {
        "comment": "We've already seen ample evidence of what happens when this ideology is imposed on institutions: sportswomen placed in serious physical danger, female prisoners incarcerated with rapists, girls' honours taken by boys, predatory men taking full advantage of new conditions. 7/12",
        "original_tweet": "They're not alone, of course. Healthcare, academic and sporting bodies are currently riddled with managers who're removing rights from adult human females in favour of men they consider 'women' due to paperwork or simple self-declaration. 6/12\nhttps://t.co/52QMD7Olj1",
        "created_at": "2024-10-15 15:24:55+00:00"
    },
    {
        "comment": "Brindley and Wadhwa appear to have agreed that it is 'progressive' to pretend gender identity should supersede sex as the measure of what a woman is. This is in spite of the fact that 98% of sexual offenders are male (irrespective of how they identify) and 88% female. 5/12",
        "original_tweet": "Under Brindley’s stewardship, a trans-identified man was appointed to run the Edinburgh centre. Mridul Wadhwa believed rape victims who wanted single sex spaces needed ‘re-educating’ and gender critical staff should be dealt with by being fired. 4/12\nhttps://t.co/rCr6DoMfKX",
        "created_at": "2024-10-15 15:23:04+00:00"
    },
    {
        "comment": "One year on and Brindley still hasn't produced her definition. You might think the CEO of a service that claims to offer woman-only support would be able to say what a woman is, but Brindley is one of those whose ideology forbids any definition of women that excludes men. 3/12",
        "original_tweet": "As Roz says: 'I don’t know how any organisation can claim to have women only spaces or services while not defining what a woman is or what female means.'\n\nIn 2023, Sandy Brindley, CEO of RCS, said 'work was underway' on a definition of women. 2/12\nhttps://t.co/KUx8gwTAwd.",
        "created_at": "2024-10-15 15:21:23+00:00"
    },
    {
        "comment": "@IsadoraClarus @Kassandra_Zerb You're wilfully misrepresenting what I've said and, in doing so, indulging in exactly the behaviour I was criticising when I wrote that post.",
        "original_tweet": "@Kassandra_Zerb JK Rowling believes in true trans. Feminists are women who fell for a CIA program to get them out of the house and onto the tax rolls. 'Cos caring for a family that loves you is oppression, but working for a boss who doesn't care about you is liberation. \nhttps://t.co/1PFlHLVVXA",
        "created_at": "2024-10-13 13:55:00+00:00"
    },
    {
        "comment": "@helenstaniland You can borrow a couple of my four-year-old coal miners, if you like. To be honest, they're not proving very cost effective.",
        "original_tweet": "@jk_rowling That's excellent. I suspect business will be booming this week then. Better pop down the local orphanage to pick up a couple of extras.",
        "created_at": "2024-10-13 13:07:00+00:00"
    },
    {
        "comment": "@helenstaniland If it's any consolation, I've just left a 5* review on the website for Staniland Chimney-Cleaning Orphans Inc. 'I've rarely met such highly motivated-five-year olds and my flues have never been so clean.'",
        "original_tweet": "This is one of the more left field accusations linked to my objecting to the push for male adults to have access to female changing rooms. https://t.co/DP6rz4d3aX",
        "created_at": "2024-10-13 12:29:26+00:00"
    },
    {
        "comment": "@msjlindsay Knock 'em out, Jenny x 🦊",
        "original_tweet": "Right, London, let's be having ye. \"Cancelled poet tour\" herewegooooo 🦊😉 https://t.co/Nn52Bmmi3d",
        "created_at": "2024-10-13 09:26:26+00:00"
    },
    {
        "comment": "@maggivaughan @BrianSpanner1 You're hired.",
        "original_tweet": "@jk_rowling @BrianSpanner1 I'll give you a recipe talking through stovies.",
        "created_at": "2024-10-12 15:54:09+00:00"
    }
]