[
    {
        "comment": "This weekend in New York City, I will be joining girl activists from around the world to send a clear message to leaders: Listen to girls, take action for their rights and invest in their priorities. Stay tuned for updates.",
        "original_tweet": "A girl born today will have to wait until her 97th birthday to live in a gender equal world. I hope world leaders attending the UN General Assembly and Summit of the Future read this new data from @Equal2030 to understand what girls are up against. https://t.co/Ec8WOilTdW",
        "created_at": "2024-09-17 21:34:02+00:00"
    },
    {
        "comment": "@vanessa_vash @BlavatnikSchool @whtrust_ox Congratulations, Vanessa! 🤩",
        "original_tweet": "The secret is out!\n\nI'm overjoyed to share that I've been awarded the Weidenfeld-Hoffmann Trust Scholarship to pursue a Master of Public Policy at the Blavatnik School of Government, University of Oxford!\n\nAs a climate justice activist from Uganda, this scholarship is a testament… https://t.co/ILjjk0gc8q https://t.co/KmWT3hNR74",
        "created_at": "2024-09-11 14:29:44+00:00"
    },
    {
        "comment": "More than ever, Muslim countries and Muslim scholars alike must speak out with a unified voice: the Taliban are distorting and misusing Islam to legitimise their oppressive system.",
        "original_tweet": "Their regime does not exist in a vacuum. The world has emboldened them by offering platitudes and sympathy to Afghan women and girls without taking action to hold the Taliban to account. The ban on girls’ education past grade six seems to have been accepted by many as the new… https://t.co/fOG8FcEMrC",
        "created_at": "2024-08-29 13:23:30+00:00"
    },
    {
        "comment": "I hope we will keep fighting together to ensure all Pakistani youth – especially girls – have equal rights and access to education.\n\nHappy Independence Day. Pakistan Zindabad! 💚",
        "original_tweet": "My message to Pakistan’s youth, especially girls, is keep working hard to achieve your goals and stay focused on school, get involved in sports and find ways to serve your community. Together, we can move Pakistan forward in a better direction and build a brighter future.",
        "created_at": "2024-08-13 23:13:50+00:00"
    },
    {
        "comment": "My message to Pakistan’s youth, especially girls, is keep working hard to achieve your goals and stay focused on school, get involved in sports and find ways to serve your community. Together, we can move Pakistan forward in a better direction and build a brighter future.",
        "original_tweet": "On this occasion, I want to congratulate our amazing Olympians for their hard work and for representing Pakistan’s potential on the world’s stage. A special shout out to Javelin thrower, Arshad Nadeem, for bringing home gold and setting an Olympic record!",
        "created_at": "2024-08-13 23:13:49+00:00"
    },
    {
        "comment": "On this occasion, I want to congratulate our amazing Olympians for their hard work and for representing Pakistan’s potential on the world’s stage. A special shout out to Javelin thrower, Arshad Nadeem, for bringing home gold and setting an Olympic record!",
        "original_tweet": "Happy Independence Day to all Pakistanis, at home and around the world 🇵🇰 https://t.co/MiCfoB9QP7",
        "created_at": "2024-08-13 23:13:49+00:00"
    },
    {
        "comment": "Together, we discussed what life is like for Afghan girls now and what it means to stand in solidarity with them. The students’ conviction and empathy made me hopeful for our future.",
        "original_tweet": "I wanted to spend my 27th birthday raising awareness of the situation girls are facing in Afghanistan, who live under the Taliban’s brutal regime of gender apartheid, deprived of their basic rights and banned from going to school past grade six.",
        "created_at": "2024-07-19 19:50:50+00:00"
    },
    {
        "comment": "I wanted to spend my 27th birthday raising awareness of the situation girls are facing in Afghanistan, who live under the Taliban’s brutal regime of gender apartheid, deprived of their basic rights and banned from going to school past grade six.",
        "original_tweet": "Still buzzing after the amazing conversations I had last week with Muska, Sana and Somaya and their classmates at Harrow High School @HarrowHighSch 💞\nhttps://t.co/S5Xwy2qzCK",
        "created_at": "2024-07-19 19:50:49+00:00"
    },
    {
        "comment": "My message to world leaders everywhere: join the global movement demanding accountability, and stand in solidarity with Afghan women and girls.",
        "original_tweet": "I sat down with @SkyYaldaHakim to talk about what the Taliban are doing to millions of women and girls in Afghanistan — whose rights, dignity and livelihoods are being systematically erased under an unacceptable regime of gender apartheid. \nhttps://t.co/xifGZUXMA1",
        "created_at": "2024-07-11 21:46:07+00:00"
    },
    {
        "comment": "As the team at Anera shared with me, nothing would have a greater humanitarian impact right now for the people of Gaza – and the world – than a lasting ceasefire. We must continue to speak out, donate what we can and continue to call for an end to the violence.",
        "original_tweet": "It is incredible to see how much Anera is able to accomplish, despite the horrific circumstances, with the support of so many donors and partners. I hope you will learn more about their inspiring work to provide essential services to people in Gaza and beyond. You can follow them… https://t.co/HEOK8Aq4Aj",
        "created_at": "2024-06-29 21:37:04+00:00"
    },
    {
        "comment": "Since October 2023, Anera’s team has been able to provide:\n🧡30 million + meals\n🧡36,000+ hygienic supply kits\n🧡50,000+ menstrual pads packs\n🧡300,000+ bottles of water\n🧡300+ psychosocial activities for children\n🧡6 million+ medicines and medical supplies",
        "original_tweet": "Anera @AneraOrg is another amazing organisation working in Gaza with whom @MalalaFund partnered to help young women and children access education programs, healthcare, food and other basic needs. https://t.co/wtrlEgEdkJ",
        "created_at": "2024-06-29 21:37:03+00:00"
    },
    {
        "comment": "It is unacceptable that children and families in Gaza are struggling to survive and facing these horrible conditions. Together, we must continue our call for an immediate and lasting ceasefire to end this needless violence and suffering.",
        "original_tweet": "PCRF's emergency response initiatives bring essential aid, comfort and support to displaced communities in Gaza and beyond. I encourage you to learn more about @thePCRF by following their channels.\nhttps://t.co/scdjbl38y2",
        "created_at": "2024-06-28 17:42:18+00:00"
    },
    {
        "comment": "Many brave women and girls are fighting back, learning in secret and refusing to let the Taliban deny them their rights. They need and deserve our support.\n\nLift up the voices of Afghan women and girls on the frontlines. Use your platforms to speak out against gender apartheid.",
        "original_tweet": "The Taliban has made girlhood illegal and instituted a form of oppression that will rob an entire generation of their rights and futures.\n\nThey should not have to fight alone.\nThey deserve our solidarity\nAnd they deserve action.",
        "created_at": "2024-06-14 10:13:48+00:00"
    },
    {
        "comment": "The Taliban has made girlhood illegal and instituted a form of oppression that will rob an entire generation of their rights and futures.\n\nThey should not have to fight alone.\nThey deserve our solidarity\nAnd they deserve action.",
        "original_tweet": "There is no shortage of tragedy in the world, from Gaza to Sudan to Ukraine. But today, I’m urging the world to speak up for Afghan girls because their situation is unique. Afghanistan is the only country in the world that bans girls from going to school.",
        "created_at": "2024-06-14 10:13:47+00:00"
    },
    {
        "comment": "There is no shortage of tragedy in the world, from Gaza to Sudan to Ukraine. But today, I’m urging the world to speak up for Afghan girls because their situation is unique. Afghanistan is the only country in the world that bans girls from going to school.",
        "original_tweet": "It’s been 1000 days since the Taliban banned girls’ secondary education. Afghan women and girls are living under gender apartheid — but they are fighting back. That's why @MalalaFund is supporting orgs working to keep girls learning in Afghanistan with $1.5M in new funding. https://t.co/GnABcX9fsx",
        "created_at": "2024-06-14 10:13:47+00:00"
    },
    {
        "comment": "Soon I will be announcing additional support for Palestinian-led organizations and humanitarian efforts— building on the more than $300,000 Malala Fund has already committed to this cause in recent months.",
        "original_tweet": "We’ve all seen examples of young people in Gaza documenting their lives in real-time and calling the world to action. This initiative is not just a scholarship; it is a signal of our solidarity to these young Palestinians, whose voices and demands will continue to resonate across… https://t.co/RcH8Cd9qOg",
        "created_at": "2024-05-31 01:03:20+00:00"
    },
    {
        "comment": "This new scholarship will aim to ease financial obstacles for Palestinian students who aspire to study at Oxford; the first recipient of this scholarship will join this October.",
        "original_tweet": "I was honoured to announce a new graduate scholarship for Palestinian students as part of my ongoing work with the Oxford Pakistan Programme, the Refugee Academic Futures Programmes, and @malalafund.",
        "created_at": "2024-05-31 01:03:20+00:00"
    },
    {
        "comment": "I was honoured to announce a new graduate scholarship for Palestinian students as part of my ongoing work with the Oxford Pakistan Programme, the Refugee Academic Futures Programmes, and @malalafund.",
        "original_tweet": "Rebuilding Gaza’s education system will require a lasting ceasefire and years of investment. But in the interim, we must all do everything we can to lend our support to as many Palestinian students as possible by sharing their stories, echoing their calls to action and funding… https://t.co/7NyIm8L3d1",
        "created_at": "2024-05-31 01:03:19+00:00"
    },
    {
        "comment": "Commitments like those outlined today—including a promise to grow the education budget to 4% of GDP —will make Pakistan a more prosperous country for everyone. Together with our partners, I look forward to tracking progress from the government on these initiatives.",
        "original_tweet": "It is encouraging that Prime Minister Shehbaz Sharif has developed an emergency plan to help millions more children in Pakistan realize their right to education. https://t.co/thpbAOKp2K",
        "created_at": "2024-05-16 21:26:32+00:00"
    },
    {
        "comment": "loved my first women’s ice hockey game ☺️",
        "original_tweet": "🌝🌝🌝 https://t.co/VTGDvHZONc",
        "created_at": "2024-04-21 21:29:23+00:00"
    },
    {
        "comment": "@ELLEmagazine Thank you for honouring the @SuffsMusical team 💜",
        "original_tweet": "Hillary Clinton, Malala Yousafzai, and Shaina Taub on Bringing Women’s Suffrage to Broadway With 'Suffs' https://t.co/j1TLzuUpTC",
        "created_at": "2024-03-27 19:13:11+00:00"
    }
]