[
    {
        "text": "Remembering Lata Didi on her birth anniversary. She will always live on in the hearts and minds of people due to her soulful songs. \n\nLata Didi and I had a special bond. I have been fortunate to receive her affection and blessings.\n\nhttps://t.co/ujzzagwq3s",
        "created_at": "2024-09-28 03:52:23+00:00"
    },
    {
        "text": "मातृभूमि के स्वाभिमान की रक्षा के लिए अपना जीवन बलिदान करने वाले अमर शहीद भगत सिंह को उनकी जन्म-जयंती पर शत-शत नमन। https://t.co/9s0mJ5guRG",
        "created_at": "2024-09-28 03:34:35+00:00"
    },
    {
        "text": "Deeply pained by the passing away of Pappammal Ji. She made a mark in agriculture, especially organic farming. People admired her for her humility and kind nature. My thoughts are with her family and well wishers. Om Shanti. https://t.co/3JR9LqlMmB",
        "created_at": "2024-09-27 17:49:20+00:00"
    },
    {
        "text": "A remarkable feat! Our Government is committed to ensuring a vibrant innovation ecosystem, which can transform the lives of the youth. https://t.co/wCAFTOYB8c",
        "created_at": "2024-09-27 15:21:39+00:00"
    },
    {
        "text": "Had a great meeting with the leadership team of Tata Sons and PSMC. They shared updates on their Semiconductor manufacturing projects. PSMC expressed enthusiasm to further expand its footprint in India. https://t.co/uyriq9qiLb",
        "created_at": "2024-09-26 14:42:54+00:00"
    },
    {
        "text": "With Param Rudra Supercomputers and HPC system, India takes significant step towards self-reliance in computing and driving innovation in science and tech. https://t.co/ZUlM5EA3yw",
        "created_at": "2024-09-26 12:34:26+00:00"
    },
    {
        "text": "A boost to tech related innovations! \n\nAt around 5:30 PM this evening, via video conferencing, I will be inaugurating 3 Param Rudra Super Computing Systems and a High Performance Computing System for weather and climate. Will specially urge my young friends to join...",
        "created_at": "2024-09-26 10:39:02+00:00"
    },
    {
        "text": "हरियाणा में भाजपा कार्यकर्ताओं को जन-जन तक सुशासन का संदेश पहुंचाते हुए देखना बेहद उत्साहजनक है। 'मेरा बूथ, सबसे मजबूत' कार्यक्रम को संबोधित कर रहा हूं, जरूर जुड़ें!\nhttps://t.co/pO9zjcNTia",
        "created_at": "2024-09-26 07:03:27+00:00"
    },
    {
        "text": "Birthday greetings to former PM Dr. Manmohan Singh Ji. I pray that he is blessed with a long and healthy life.",
        "created_at": "2024-09-26 03:49:53+00:00"
    },
    {
        "text": "सोनीपत में जनता-जनार्दन से मिला अपनापन और आशीर्वाद भाजपा की जीत की गारंटी है। https://t.co/Eh3KbrXU08",
        "created_at": "2024-09-25 15:47:42+00:00"
    },
    {
        "text": "हर क्षेत्र में अपना दमखम दिखाने वाली हरियाणा की नारीशक्ति को और सशक्त करने के लिए हम कोई कोर-कसर नहीं छोड़ रहे हैं। https://t.co/7Ki7waFi1K",
        "created_at": "2024-09-25 15:46:10+00:00"
    },
    {
        "text": "कांग्रेस को वोट देने का मतलब है- हरियाणा की बर्बादी को आमंत्रित करना। https://t.co/qlaP5NCsCg",
        "created_at": "2024-09-25 15:45:20+00:00"
    },
    {
        "text": "हरियाणा के लोगों को कांग्रेस की आरक्षण विरोधी चालों से सावधान रहना है। https://t.co/cYZiMd1SJI",
        "created_at": "2024-09-25 15:44:09+00:00"
    },
    {
        "text": "देश के दुश्मनों के एजेंडे को भारत में लागू करने की साजिश में जुटी कांग्रेस को हरियाणा के लोग सबक सिखाकर ही रहेंगे। https://t.co/kK47xFtaIZ",
        "created_at": "2024-09-25 15:43:18+00:00"
    },
    {
        "text": "किसान भाई-बहनों की आंखों में धूल झोंकने वाली कांग्रेस वहां भी अपने वादों को नहीं निभाती, जहां उसकी सरकारें हैं। https://t.co/7U2mFxd5QP",
        "created_at": "2024-09-25 15:41:55+00:00"
    },
    {
        "text": "जहां-जहां कांग्रेस ने कदम रखा, करप्शन और भाई-भतीजावाद पक्का! https://t.co/l0Q2Y0Vjgi",
        "created_at": "2024-09-25 15:40:51+00:00"
    },
    {
        "text": "न्यूयॉर्क में हरियाणा के मेरे बेटे-बेटियों ने जिस तरह से मेरा भव्य स्वागत किया, उसने हृदय को छू लिया! https://t.co/ZO9fstNLOn",
        "created_at": "2024-09-25 15:38:44+00:00"
    },
    {
        "text": "दलित और वंचित समाज को उद्योगों में अवसर देकर ही सच्चा सशक्तिकरण संभव है, बाबासाहेब की यही सोच भाजपा की नीति, निर्णय और विचारों में दिखाई देती है। https://t.co/wf98DTTzka",
        "created_at": "2024-09-25 15:37:32+00:00"
    },
    {
        "text": "राजस्थान के सूरसागर की पूर्व विधायक और भाजपा की वरिष्ठ नेता श्रीमती सूर्यकांता व्यास जी के निधन से अत्यंत दुख हुआ है। क्षेत्र में जनकल्याण के अपने कार्यों के लिए उन्हें सदैव याद किया जाएगा। हाल की मेरी जोधपुर यात्रा के दौरान उनसे मिलने का अवसर प्राप्त हुआ था, जब उन्होंने विशेष… https://t.co/wwx5dJGYv3 https://t.co/waPggdtUgi",
        "created_at": "2024-09-25 13:54:20+00:00"
    },
    {
        "text": "A salute to every innovator and wealth creator who has powered the spirit of @makeinindia. This initiative has furthered growth and given wings for our Yuva Shakti to dream big! Penned a few thoughts on @LinkedIn. \nhttps://t.co/JTXZL5cPxp  \n\n#10YearsOfMakeInIndia",
        "created_at": "2024-09-25 13:12:05+00:00"
    },
    {
        "text": "सोनीपत में उत्साह और उमंग से साफ है कि जनता-जनार्दन के आशीर्वाद से भाजपा लगातार तीसरी बार हरियाणा में बहुमत की सरकार बनाने जा रही है।\nhttps://t.co/hFYi82yR0H",
        "created_at": "2024-09-25 07:30:09+00:00"
    },
    {
        "text": "Today, we mark #10YearsOfMakeInIndia. I compliment all those who are tirelessly working to make this movement a success over the last decade. ‘Make in India’ illustrates the collective resolve of 140 crore Indians to make our nation a powerhouse of manufacturing and innovation.… https://t.co/KNx60EEHW1",
        "created_at": "2024-09-25 05:42:10+00:00"
    },
    {
        "text": "महान राष्ट्रवादी विचारक पंडित दीनदयाल उपाध्याय जी को उनकी जयंती पर कोटि-कोटि नमन। अंत्योदय की उनकी अवधारणा विकसित भारत के संकल्प की सिद्धि में अमूल्य भूमिका निभाने वाली है। देश के लिए उनका समर्पण और सेवा भाव अविस्मरणीय रहेगा। https://t.co/0tZ4oxcZ01",
        "created_at": "2024-09-25 02:56:06+00:00"
    },
    {
        "text": "जम्मू-कश्मीर में आज विधानसभा चुनाव के दूसरे दौर की वोटिंग है। सभी वोटर्स से मेरी अपील है कि वे अपना वोट जरूर दें और लोकतंत्र को मजबूत बनाने में अपनी अहम भूमिका निभाएं। इस अवसर पर पहली बार वोट डालने जा रहे सभी युवा साथियों को मेरा अभिनंदन!",
        "created_at": "2024-09-25 01:41:40+00:00"
    },
    {
        "text": "हरियाणा ने विधानसभा चुनाव में भाजपा को भारी बहुमत से जिताने का पक्का इरादा कर लिया है। लोकतंत्र के उत्सव में उत्साह और उमंग के इसी माहौल के बीच कल दोपहर 12 बजे सोनीपत की रैली में जनता-जनार्दन का आशीर्वाद प्राप्त करने का सौभाग्य मिलेगा।",
        "created_at": "2024-09-24 16:10:05+00:00"
    },
    {
        "text": "This has been a fruitful USA visit, covering diverse programmes and focusing on a series of subjects aimed at making our planet better. Here are the highlights. https://t.co/JXKS0XKDps",
        "created_at": "2024-09-24 08:08:20+00:00"
    },
    {
        "text": "Met President @ZelenskyyUa in New York. We are committed to implementing the outcomes of my visit to Ukraine last month to strengthen bilateral relations. Reiterated India’s support for early resolution of the conflict in Ukraine and restoration of peace and stability. https://t.co/YRGelX1Gl5",
        "created_at": "2024-09-23 22:00:26+00:00"
    },
    {
        "text": "Had a great conversation with Cardinal Pietro Parolin, Secretary of State of the Holy See in New York. https://t.co/qatCagH55i",
        "created_at": "2024-09-23 21:00:06+00:00"
    },
    {
        "text": "Wonderful to have met Prime Minister Nikol Pashinyan of Armenia on the sidelines of the Summit of the Future at the @UN earlier today. @NikolPashinyan https://t.co/Au5f9Da5T0",
        "created_at": "2024-09-23 20:52:14+00:00"
    },
    {
        "text": "Met Mr. To Lam, the President of Vietnam. We took stock of the full range of India-Vietnam friendship. We look forward to adding momentum in sectors such as connectivity, trade, culture and more. https://t.co/aV5SD2nI4N",
        "created_at": "2024-09-23 18:40:31+00:00"
    },
    {
        "text": "Speaking at Summit of the Future at the @UN. https://t.co/lxhOQEWEC8",
        "created_at": "2024-09-23 15:31:16+00:00"
    },
    {
        "text": "An unforgettable community programme in New York, deepening the bond with our diaspora! https://t.co/KgrQKt96Kn",
        "created_at": "2024-09-23 13:54:49+00:00"
    },
    {
        "text": "Addressing the tech CEOs' roundtable in New York.\nhttps://t.co/dMqsJpP1DE",
        "created_at": "2024-09-23 03:31:51+00:00"
    },
    {
        "text": "Met President Mahmoud Abbas in New York. Reiterated India’s support for early restoration of peace and stability in the region. Exchanged views of further strengthening long standing friendship with the people of Palestine. https://t.co/LnmAm7dDax",
        "created_at": "2024-09-23 01:35:19+00:00"
    },
    {
        "text": "The talks with His Highness Sheikh Sabah Khaled Al-Hamad Al-Sabah, the Crown Prince of Kuwait, were very productive. We discussed how to add vigour to India-Kuwait ties in sectors like pharma, food processing, technology, energy and more. https://t.co/MKmjlNglm3",
        "created_at": "2024-09-23 00:45:03+00:00"
    },
    {
        "text": "Had a fruitful roundtable with tech CEOs in New York, discussing aspects relating to technology, innovation and more.  Also highlighted the strides made by India in this field. I am glad to see immense optimism towards India. https://t.co/qW3sZ4fv3t",
        "created_at": "2024-09-23 00:22:57+00:00"
    },
    {
        "text": "Had a very good meeting with Prime Minister KP Oli in New York. The India-Nepal friendship is very robust and we look forward to adding even more momentum to our ties. Our talks focused on issues such as energy, technology and trade. @kpsharmaoli https://t.co/WGrSrL8mEO",
        "created_at": "2024-09-23 00:22:04+00:00"
    },
    {
        "text": "मुझे आपको ये बताते हुए बहुत खुशी है कि... https://t.co/B7eyYCjpQv",
        "created_at": "2024-09-23 00:20:48+00:00"
    },
    {
        "text": "A ‘Made in India’ chip will become a reality and this is Modi’s Guarantee. https://t.co/WkGW4RmSYS",
        "created_at": "2024-09-23 00:19:50+00:00"
    },
    {
        "text": "Today’s India is filled with opportunities! Come, be a part of our growth story. https://t.co/bROhptd0At",
        "created_at": "2024-09-23 00:19:00+00:00"
    },
    {
        "text": "Our Government is focused on making India prosperous and this reflects in our work culture as well as decisions. https://t.co/dw3aIXZ5BU",
        "created_at": "2024-09-23 00:17:56+00:00"
    },
    {
        "text": "पुष्प (PUSHP) की इन पांच पंखुड़ियों को मिलाकर ही हमें विकसित भारत बनाना है… https://t.co/6uEnN142MI",
        "created_at": "2024-09-23 00:15:38+00:00"
    },
    {
        "text": "AI for me is also America-India. The scope of our friendship is unlimited. https://t.co/b2bMacZtkI",
        "created_at": "2024-09-23 00:14:15+00:00"
    },
    {
        "text": "Thank you New York! These are glimpses from the memorable community programme. Grateful to all those who joined. @ModiandUS https://t.co/2OokNwYTb2",
        "created_at": "2024-09-23 00:12:25+00:00"
    },
    {
        "text": "Historic win for India as our chess contingent wins the 45th #FIDE Chess Olympiad! India has won the Gold in both open and women’s category at Chess Olympiad! Congratulations to our incredible Men's and Women's Chess Teams. This remarkable achievement marks a new chapter in… https://t.co/C8kHsWkYer https://t.co/FUYHfK2Jtu",
        "created_at": "2024-09-22 19:24:17+00:00"
    },
    {
        "text": "Congratulations @anuradisanayake, on your victory in the Sri Lankan Presidential elections. Sri Lanka holds a special place in India's Neighbourhood First Policy and Vision SAGAR. I look forward to working closely with you to further strengthen our multifaceted cooperation for… https://t.co/RuE4WQCVmZ",
        "created_at": "2024-09-22 18:22:16+00:00"
    },
    {
        "text": "The warmth and energy of the Indian diaspora in New York is unparalleled. Addressing a community programme. Do watch! https://t.co/ttabGnATaD",
        "created_at": "2024-09-22 16:28:56+00:00"
    },
    {
        "text": "Today, on #WorldRhinoDay, let us reiterate our commitment to protect one of our planet’s most iconic species—rhinos. Compliments to all those involved in rhino conservation efforts over the last many years. \n\nIt is a matter of immense pride that India is home to a large number of… https://t.co/Kp1lkKKHHl https://t.co/VbUcQkeVZv",
        "created_at": "2024-09-22 04:57:44+00:00"
    },
    {
        "text": "After programmes in Delaware, landed in New York. Eager to be among the diaspora at the community programme in the city and to take part in other programmes. https://t.co/6Q48tyW4hV",
        "created_at": "2024-09-22 04:17:25+00:00"
    },
    {
        "text": "Deepening cultural connect and strengthening the fight against illicit trafficking of cultural properties. \n\nI am extremely grateful to President Biden and the US Government for ensuring the return of 297 invaluable antiquities to India. @POTUS @JoeBiden https://t.co/0jziIYZ1GO",
        "created_at": "2024-09-22 02:59:56+00:00"
    }
]