[
    {
        "text": "These once-in-a generation, historical storms are happening once or twice every month.\nClimate change.",
        "created_at": "2024-09-27 23:11:04+00:00"
    },
    {
        "text": "Midnight Pass is open again.\nMan proposes, God disposes.",
        "created_at": "2024-09-27 19:44:58+00:00"
    },
    {
        "text": "HJappy birthday to Mark Hamill!",
        "created_at": "2024-09-27 00:30:54+00:00"
    },
    {
        "text": "NEVER LET GO: A dark fairy tale for grownups. I enjoyed it. Halle Berry and a couple of fantastic little kids.",
        "created_at": "2024-09-27 00:04:07+00:00"
    },
    {
        "text": "AP has a story titled something like, \"How to Get Through Election Season Without Losing Your Mind.\"\nFor some of us, it's too late.",
        "created_at": "2024-09-26 19:45:47+00:00"
    },
    {
        "text": "Notice that a hurricane never *moves* toward land, or *races* toward land; they always *barrel.* Not sure how that became the go-to word.",
        "created_at": "2024-09-26 11:24:25+00:00"
    },
    {
        "text": "This is a wonderful memoir with an odd title. https://t.co/LXzUNMlkIy",
        "created_at": "2024-09-25 14:20:34+00:00"
    },
    {
        "text": "I watched one of the best movies I've seen this year. It's called THE RULE OF JENNY PEN, and I urge you to watch it when it appears on Shudder. Geoffrey Rush stars, with John Lithgow as a geriatric psychopath with an evil hand puppet.",
        "created_at": "2024-09-25 00:05:41+00:00"
    },
    {
        "text": "Chicago White Sox fans, I feel your pain. As a fan of those other Sox, I tried to switch my loyalty to Cleveland during one particularly awful season (Butch Hobson, I’m talking about you). I couldn’t do it.\nThings will get better. They CAN’T get worse.",
        "created_at": "2024-09-23 11:32:46+00:00"
    },
    {
        "text": "When does a joke become a dad joke?\nWhen it becomes apparent.",
        "created_at": "2024-09-23 00:49:49+00:00"
    },
    {
        "text": "Let’s all quit posting about politics for 7 days.\nI’ll start.",
        "created_at": "2024-09-22 19:57:47+00:00"
    },
    {
        "text": "Trump has very little ground game--few people leafleting or ringing doorbells. The campaign is counting on voter suppression and pushing Nebraska lawmakers to cancel out the Omaha vote for Harris. They have given up on winning the popular vote.",
        "created_at": "2024-09-22 18:47:01+00:00"
    },
    {
        "text": "https://t.co/co885EE1kS",
        "created_at": "2024-09-22 14:57:38+00:00"
    },
    {
        "text": "Republican Paul Ryan, former Speaker of the House, says he won’t be voting for Donald Trump. “Character means too much to me.”",
        "created_at": "2024-09-22 00:20:48+00:00"
    },
    {
        "text": "Thanks! https://t.co/782FmqnI9b",
        "created_at": "2024-09-21 23:24:13+00:00"
    },
    {
        "text": "I'm actually a little overwhelmed by all the good wishes. Let's move along, folks, nothing more to see here.",
        "created_at": "2024-09-21 23:23:53+00:00"
    },
    {
        "text": "I got a ton of birthday wishes. Thanks to every one of you. Sometimes Twitter sucks, but sometimes it's a pretty nice place to visit.",
        "created_at": "2024-09-21 20:40:29+00:00"
    },
    {
        "text": "Whoa, thanks! https://t.co/KZDodQ49fG",
        "created_at": "2024-09-21 15:28:59+00:00"
    },
    {
        "text": "https://t.co/0RA98G65E5",
        "created_at": "2024-09-20 19:31:24+00:00"
    },
    {
        "text": "Just repeating: Muskl doesn't believe the conspiracy theories and fake facts he posts; it's just an effort to pump viewership on Twitter.",
        "created_at": "2024-09-20 13:13:01+00:00"
    },
    {
        "text": "\"People\" who have asked for \"anonymity?\" Several of whom have now refuted this absurd claim. https://t.co/AAVrLhK4O9",
        "created_at": "2024-09-19 19:22:37+00:00"
    },
    {
        "text": "Elon Musk's increasingly loopy (not to mention fictional) posts have nothing to do with politics; it's an attempt to gin up interest in X. It's all about business.",
        "created_at": "2024-09-19 18:12:06+00:00"
    },
    {
        "text": "I've read this book, and it's terrific. https://t.co/LfVlJnuNm0",
        "created_at": "2024-09-18 18:45:55+00:00"
    },
    {
        "text": "Trump mistook a wildlife refuge in Alaska for an Afghan airbase. His brains are turning to mush.",
        "created_at": "2024-09-18 15:29:50+00:00"
    },
    {
        "text": "Ryan Routh looks several cans short of a six-pack.",
        "created_at": "2024-09-17 20:27:37+00:00"
    },
    {
        "text": "Democrats talk about Trump as a danger to democracy. There is no incitement to violence. On the other hand, Mark Robinson, the Republican candidate for governor, said \"Some people need killing.\"\nPot, meet kettle.",
        "created_at": "2024-09-17 19:09:56+00:00"
    },
    {
        "text": "My fave Taylor Swift song.\nOf course.\nhttps://t.co/PxBcGmLQTg",
        "created_at": "2024-09-16 20:25:28+00:00"
    },
    {
        "text": "It's a little movie that could. https://t.co/f7Fxa7prhU",
        "created_at": "2024-09-15 23:50:12+00:00"
    },
    {
        "text": "I love Taylor Swift.\nHer music makes me happy.\nEnd of story.",
        "created_at": "2024-09-15 23:45:41+00:00"
    },
    {
        "text": "I got your back. https://t.co/jBbmW8rm6e",
        "created_at": "2024-09-15 23:17:20+00:00"
    },
    {
        "text": "LIFE OF CHUCK was the dark horse winner of the Toronto International Film Festival (TIFF) People's Choice Award. I'm so blissed out for Mike Flanagan and his talented troupe of actors.",
        "created_at": "2024-09-15 15:36:03+00:00"
    },
    {
        "text": "REBEL RIDGE: If this is a Netflix original, it's one of the best. A thinking man's RAMBO. No diss to David Morrell.",
        "created_at": "2024-09-14 23:31:11+00:00"
    },
    {
        "text": "No 2nd Trump/Harris debate. I guess Trump decided one ass-kicking was enough.",
        "created_at": "2024-09-12 22:48:08+00:00"
    },
    {
        "text": "No proof. https://t.co/kWKHf1AxSC",
        "created_at": "2024-09-12 21:18:30+00:00"
    },
    {
        "text": "https://t.co/1VAdnaqCNf",
        "created_at": "2024-09-12 19:12:07+00:00"
    },
    {
        "text": "I repeat: You are too smart to believe Trump will do a better job. https://t.co/xg9LKI69Cp",
        "created_at": "2024-09-12 16:01:17+00:00"
    },
    {
        "text": "Florida voters: According to MTN, Ron DeSantis is using taxpayer funds to advocate against Amendment 4 (the abortion amendment).",
        "created_at": "2024-09-12 16:00:01+00:00"
    },
    {
        "text": "SALEM’S LOT trailer is coming. It’s a good one.",
        "created_at": "2024-09-11 22:30:27+00:00"
    },
    {
        "text": "Perhaps Trump should take a leaf from Joe Biden’s playbook and announce he is dropping out of the race. That way he can say, “I could have won.”",
        "created_at": "2024-09-11 20:50:53+00:00"
    },
    {
        "text": "Kamala Harris's face kept saying, \"Go ahead, Donald, have your tantrum, and then the adults will speak.\" He got more time than she did...but she didn't need more time. Her face said it all. 🤣",
        "created_at": "2024-09-11 18:57:30+00:00"
    },
    {
        "text": "Thier moderators had to keep fact-checking Donald because he kept telling whoppers. Guess he forgot he wasn't on the Fox News network. https://t.co/S70iMxei5B",
        "created_at": "2024-09-11 18:54:31+00:00"
    },
    {
        "text": "Politics aside, America saw a man who has no business being near the levers of power. Simply put, he’s crazy.",
        "created_at": "2024-09-11 10:39:33+00:00"
    },
    {
        "text": "They have allowed Trump a disproportionate amount of time to mansplain. https://t.co/i2oVrNeuSw",
        "created_at": "2024-09-11 02:39:41+00:00"
    },
    {
        "text": "Notice how red he’s getting.",
        "created_at": "2024-09-11 01:38:26+00:00"
    },
    {
        "text": "Trump sounds barking mad.",
        "created_at": "2024-09-11 01:35:18+00:00"
    },
    {
        "text": "Seven people have died in that chair: two heart attacks, two strokes, two choking incidents, and one case of spontaneous bleeding from nose, mouth, and ears. DON'T SIT IN IT. https://t.co/HLBIZGNvKK",
        "created_at": "2024-09-10 23:51:01+00:00"
    },
    {
        "text": "Eric Goldstein apparently took bribes to put tainted chicken tenders on New York City school lunch menus. No matter what your political beliefs, you gotta think this is nasty.",
        "created_at": "2024-09-10 11:42:45+00:00"
    },
    {
        "text": "Lookin' good, Joe! https://t.co/5DTIYPDo9x",
        "created_at": "2024-09-10 00:48:06+00:00"
    },
    {
        "text": "What Mark said. https://t.co/i0lGpmdITM",
        "created_at": "2024-09-09 13:31:55+00:00"
    },
    {
        "text": "Popular Mechanics says Space X explosion in November blew a hole in the ionosphere.",
        "created_at": "2024-09-08 23:25:27+00:00"
    }
]