[
    {
        "text": "As Attorney General of California, I prosecuted transnational criminal organizations that trafficked guns, drugs, and human beings. I know the importance of safety and security, especially at our border.\n\nToday, I visited the U.S.-Mexico border and spoke with Customs and Border… https://t.co/UACaarcuZM https://t.co/tM310fcwrA",
        "created_at": "2024-09-28 02:37:43+00:00"
    },
    {
        "text": "President Biden and I supported the toughest and fairest set of bipartisan border security reforms in decades.\n\nCongressional Republicans voted against them — twice.\n\nWe took executive action to reduce unlawful border crossings, which are now lower than when we took office.",
        "created_at": "2024-09-27 21:37:28+00:00"
    },
    {
        "text": "I am on my way back to Arizona for official briefings on the latest work to secure the southern border and operations to stop the flow of illegal fentanyl into our country. https://t.co/Ewfv4WBQC3",
        "created_at": "2024-09-27 18:08:24+00:00"
    },
    {
        "text": "Gun violence is the number one cause of death for children in America. It does not have to be this way.\n\nToday, President Biden and I took more bold steps to save lives. We continue to call on Congress to have the courage to act and pass commonsense gun safety legislation. https://t.co/s0blvNa8ha",
        "created_at": "2024-09-27 02:05:45+00:00"
    },
    {
        "text": "William “Bill” Lucy was a giant and a patriot who spent his life fighting for freedom, justice, and fairness.\n\nAs a leader of AFSCME, he dedicated his life to improving conditions for working families and advancing the cause of civil rights, human rights, and labor rights.… https://t.co/ObXVHiM2Y5",
        "created_at": "2024-09-27 00:48:35+00:00"
    },
    {
        "text": "President Zelenskyy, welcome back to Washington.\n\nMy support for the people of Ukraine is unwavering.\n\nI have been proud to stand with Ukraine.\n\nAnd I will continue to work with you to ensure Ukraine prevails in this war. https://t.co/2z87j3quti",
        "created_at": "2024-09-26 23:46:58+00:00"
    },
    {
        "text": "Happening Now: @POTUS and I are delivering remarks on our continued work to address the epidemic of gun violence in America. https://t.co/p8TziWHc9t",
        "created_at": "2024-09-26 21:11:22+00:00"
    },
    {
        "text": "Happening Now: President Zelenskyy and I are meeting once again at the White House, where I will reaffirm my strong and unwavering support for Ukraine against Russia’s brutal aggression. https://t.co/Cb4fU2DUPd",
        "created_at": "2024-09-26 19:47:02+00:00"
    },
    {
        "text": "The Biden-Harris Administration is bringing manufacturing back to America. We have created hundreds of thousands of new manufacturing jobs, and we will continue to support American innovation. https://t.co/G2PdPn6NT4",
        "created_at": "2024-09-25 22:09:11+00:00"
    },
    {
        "text": "From day one of our Administration, President Biden and I have fought to ensure entrepreneurs, innovators, and small business owners have the resources they need to start a business and achieve their dreams.\n\nVisit https://t.co/TOL6mQV0lq to find out how we are investing in you. https://t.co/NQzDfmqJrZ",
        "created_at": "2024-09-25 18:55:44+00:00"
    },
    {
        "text": "As Hurricane Helene strengthens, the Biden-Harris Administration stands ready to support state and local officials in their preparations and response.\n\nTo those who may be impacted by the storm: Please follow local guidance, look out for one another, and stay safe.",
        "created_at": "2024-09-25 17:10:57+00:00"
    },
    {
        "text": "President Biden and I have canceled nearly $170 billion in student loan debt for almost 5 million Americans — more than any other administration in history.\n\nWe will continue our work to create economic opportunity for every American.",
        "created_at": "2024-09-24 22:31:50+00:00"
    },
    {
        "text": "Every American should have clean, safe drinking water. That's why President Biden and I have made historic investments to improve water infrastructure and expand access to clean water. https://t.co/EuggO3IMqn",
        "created_at": "2024-09-24 18:21:01+00:00"
    },
    {
        "text": "I met today with President Sheikh Mohamed of the UAE. Together we are growing our security, tech, and economic partnership — from AI to space. We are also working to strengthen regional stability and address the grave humanitarian crises in Gaza and Sudan. https://t.co/dyyaP30ka1",
        "created_at": "2024-09-24 00:30:01+00:00"
    },
    {
        "text": "The Biden-Harris Administration has delivered the most ambitious climate agenda in history. Our Inflation Reduction Act is the largest-ever investment in climate action, and we have created more than 330,000 new clean energy jobs. https://t.co/9YjwY80UFM",
        "created_at": "2024-09-23 21:55:54+00:00"
    },
    {
        "text": "While we have made great progress, @POTUS and I are not stopping now. I am committed to working with anyone, anywhere, anytime to keep our children, families, and communities safe.",
        "created_at": "2024-09-23 20:08:38+00:00"
    },
    {
        "text": "Throughout my entire career, I have worked to make our communities safer.\n\nI prosecuted homicide cases as a District Attorney. As Attorney General of California, I got illegal firearms off the streets. And as Vice President, I have been proud to work with President Biden to enact… https://t.co/2lJHOPQEng",
        "created_at": "2024-09-23 20:08:38+00:00"
    },
    {
        "text": "Every American should have the freedom to live safe from violence.\n\nToday's new FBI data confirms that Americans are safer now than when President Biden and I took office. Violent crime is at a near 50-year low, and last year we saw the largest-ever decrease in the homicide rate.",
        "created_at": "2024-09-23 20:08:37+00:00"
    },
    {
        "text": "To the students, parents, teachers, and preachers who called for action: Thanks to you, President Biden and I enacted the most significant gun safety law in nearly 30 years.\n\nWe have more work to do. We need an assault weapons ban, red flag laws, and universal background checks. https://t.co/rFxeTRkiO5",
        "created_at": "2024-09-22 23:20:48+00:00"
    },
    {
        "text": "It is a false choice to suggest you are either in favor of the Second Amendment or you want to take everyone’s guns away.\n\nI am in favor of the Second Amendment — and I am in favor of an assault weapons ban, universal background checks, and red flag laws.",
        "created_at": "2024-09-22 20:35:16+00:00"
    },
    {
        "text": "In my role leading the first-ever White House Office of Gun Violence Prevention, I have traveled our nation to meet with survivors, advocates, students, teachers, and elected officials to discuss our work to prevent gun violence.\n\nI am proud to stand alongside you in this fight. https://t.co/ToZAroWqXp",
        "created_at": "2024-09-22 18:25:06+00:00"
    },
    {
        "text": "Every person in our nation must have the freedom to live safe from gun violence.\n\nThat is why President Biden and I enacted the most significant gun safety law in nearly 30 years and launched the first-ever White House Office of Gun Violence Prevention. https://t.co/umtAqqDPAk",
        "created_at": "2024-09-22 15:50:02+00:00"
    },
    {
        "text": "Women must have the freedom to make decisions about their own bodies.\n\nWe will continue our fight to restore reproductive freedom in all 50 states.",
        "created_at": "2024-09-21 21:10:26+00:00"
    },
    {
        "text": "The leaders of the Congressional Hispanic Caucus and I are clear: We believe in an America where every person has the opportunity not just to get by, but to get ahead. https://t.co/E23OmFR0L2",
        "created_at": "2024-09-21 16:45:41+00:00"
    },
    {
        "text": "Howard University helped shape everything I am today, and historically Black colleges and universities are preparing the next generation of leaders. Happy HBCU Week to students, faculty, and alumni across our nation! https://t.co/M0jNyVCvb7",
        "created_at": "2024-09-20 23:20:01+00:00"
    },
    {
        "text": "As we mark the anniversary of Hurricane Maria, we are thinking of the thousands of Puerto Ricans who died and their loved ones.\n\nWe are committed to enduring support for the people of Puerto Rico and building a more resilient and prosperous future for the island.",
        "created_at": "2024-09-20 22:00:00+00:00"
    },
    {
        "text": "From day one of our Administration, President Biden and I have worked to build an America where every person has the opportunity to thrive.\n\nLearn more about our accomplishments at https://t.co/arSsVa6K23. https://t.co/MUlYQSypFi",
        "created_at": "2024-09-20 18:35:01+00:00"
    },
    {
        "text": "On National POW/MIA Recognition Day, we honor our nation’s brave service members who remain missing and unaccounted for.\n\nTo their families and communities: President Biden and I stand with you. We will never stop fighting to bring your loved ones home. https://t.co/kx5LeyZt3J",
        "created_at": "2024-09-20 15:05:01+00:00"
    },
    {
        "text": "Next week at the White House, I will meet with President Zelenskyy of Ukraine for the seventh time.\n\nPresident Biden and I have been clear: Our commitment to the Ukrainian people as they fight for their freedom is unshakeable.",
        "created_at": "2024-09-20 12:01:41+00:00"
    },
    {
        "text": "President Biden and I fought to protect the pensions of over 1 million union workers and retirees.\n\nOur Administration is proud to be the most pro-union Administration in American history. https://t.co/gJildwlLua",
        "created_at": "2024-09-19 23:50:01+00:00"
    },
    {
        "text": "Happy Founders' Day to the men of Iota Phi Theta Fraternity, Inc.\n\nFor 61 years, you have advanced economic empowerment, advocated for equity, and fostered community for people across our nation. Thank you for all that you do to open doors of opportunity for so many. https://t.co/oxzgfcSo2Y",
        "created_at": "2024-09-19 22:55:39+00:00"
    },
    {
        "text": "Our nation's young leaders, like the Congressional Hispanic Caucus Institute interns, inspire me every day with their hard work, focus, and determination.\n\nKnow that every room you walk into, we will be with you and cheering you on. https://t.co/6ponvJSPVf",
        "created_at": "2024-09-19 22:20:44+00:00"
    },
    {
        "text": "Thanks to our Inflation Reduction Act, Medicare has the power to negotiate lower prescription drug prices for the first time in history.\n\nNow, millions of seniors and others on Medicare will save money on the medicine they rely on.",
        "created_at": "2024-09-19 21:40:00+00:00"
    },
    {
        "text": "Small businesses are the heart of our communities. I am proud that a record 19 million new small business applications have been filed during the Biden-Harris Administration. https://t.co/P3o6db0jEs",
        "created_at": "2024-09-19 19:30:02+00:00"
    },
    {
        "text": "The Congressional Gold Medal was just awarded to NASA's Hidden Figures: Katherine Johnson, Dr. Christine Darden, Dorothy Vaughan, Mary W. Jackson, and the many other women mathematicians, scientists, and engineers who enabled America’s leadership in space.\n\nAs a U.S. Senator, I… https://t.co/t6WeRhZNr1 https://t.co/UonjeMz5F3",
        "created_at": "2024-09-19 01:25:30+00:00"
    },
    {
        "text": "I am proud to have fought alongside the leaders of the Congressional Hispanic Caucus for many years. Together, we defended workers' rights, forgave student loan debt, and expanded health care — including for Dreamers.\n\nTogether, we will continue to move our nation forward. https://t.co/QhdL5kI6xc",
        "created_at": "2024-09-19 00:45:09+00:00"
    },
    {
        "text": "I am grateful for these organizers and so many others across our nation who are leading the fight to protect and strengthen our democracy.",
        "created_at": "2024-09-18 22:45:21+00:00"
    },
    {
        "text": "Protect the Sacred hosted a “Ride for Democracy” trail ride in Arizona, helping residents of rural communities and individuals living on Native reservations update their voter registration and register to vote. https://t.co/ItNUBnbEDX",
        "created_at": "2024-09-18 22:45:20+00:00"
    },
    {
        "text": "As part of its nationwide Vota Con Ganas campaign, Voto Latino Foundation and the Voto Latino On-Campus program partnered with 170+ Latino campus leaders to host registration events and digital activations as part of National Hispanic Heritage Month. https://t.co/p2su0ERvKc",
        "created_at": "2024-09-18 22:45:19+00:00"
    },
    {
        "text": "APIAVote held a text banking party to remind voters to register to vote on National Voter Registration Day, while their state and local partners held voter registration events at boba tea shops, Mid-Autumn Festival celebrations, community centers, and college campuses. https://t.co/crljqZs5JM",
        "created_at": "2024-09-18 22:45:17+00:00"
    },
    {
        "text": "The League of Women Voters held over 600 registration events across the country, partnering with libraries, high schools, colleges, and the WNBA. https://t.co/4e2klgEN92",
        "created_at": "2024-09-18 22:45:13+00:00"
    },
    {
        "text": "When We All Vote registered people at the iHeartRadio Music Festival, the Atlanta Dream WNBA game, live on Twitch with Questlove and other DJs, through popular apps, and with voter registration drives in 15 states. https://t.co/GJpLLSD3m0",
        "created_at": "2024-09-18 22:45:12+00:00"
    },
    {
        "text": "Earlier this year, I convened voting rights leaders to thank them for their work and issue a call to action: Join me on three National Days of Action on Voting Rights to help get Americans registered.\n\nHere's how their organizations took action: https://t.co/6BeQVWijfX",
        "created_at": "2024-09-18 22:45:08+00:00"
    },
    {
        "text": "As a proud graduate of @HowardU, I know that our nation's historically Black colleges and universities are centers of excellence.\n\n@POTUS and I are proud to announce that our Administration has invested over $17 billion in HBCUs so far—a historic investment in our young leaders. https://t.co/uMnhTNIZik",
        "created_at": "2024-09-18 20:40:07+00:00"
    },
    {
        "text": "President Biden and I call on all parties involved in Sudan’s tragic conflict to end the violence and allow humanitarian aid to reach every part of the country.\n\nWe stand with the Sudanese people and their right to a peaceful future. https://t.co/siBxBsCS58",
        "created_at": "2024-09-18 19:28:21+00:00"
    },
    {
        "text": "Happening Now: Join me as I deliver remarks at the Congressional Hispanic Caucus Institute Leadership Conference. https://t.co/ulWO9AwkAr",
        "created_at": "2024-09-18 16:48:38+00:00"
    },
    {
        "text": "For 77 years, the United States Air Force has protected us with bravery, dedication, and discipline. Our nation thanks the members of @usairforce for their service and their continued commitment to fly, fight, and win. https://t.co/aCDo0R5sed https://t.co/5zWGma1Fuo",
        "created_at": "2024-09-18 15:12:10+00:00"
    },
    {
        "text": ".@POTUS and I are in touch with western state officials as they continue their work to suppress and contain wildfires. We are supporting local firefighters with additional federal resources, and I am grateful to the first responders who are working to keep their communities safe.… https://t.co/ccueoU7nCN",
        "created_at": "2024-09-18 01:22:09+00:00"
    },
    {
        "text": "Doug and I wish Asian Americans and all those celebrating Mid-Autumn Festival a holiday filled with prosperity and joy.\n\nAs communities come together, we remember the importance of family, blessings of autumn, and that we stand on the broad shoulders of those who came before us. https://t.co/MyfcqeiG1n",
        "created_at": "2024-09-18 00:15:00+00:00"
    },
    {
        "text": "Earlier this year, I met with Abbey to hear about her IVF journey — and how extremist attacks on IVF lead to chaos, confusion, and grief.\n\nI am grateful for her and all those who are courageously sharing their stories, organizing, and fighting back. @POTUS and I stand with you. https://t.co/gTDuBZgJK9",
        "created_at": "2024-09-17 22:55:02+00:00"
    }
]